QUESTIONS = [
    {
        "id": 1,
        "text": "چند سال دیگه قصد داری از این سرمایه استفاده کنی؟",
        "options": [
            {"text": "کمتر از ۲ سال", "score": 1},
            {"text": "۲ تا ۵ سال", "score": 2},
            {"text": "۵ تا ۱۰ سال", "score": 3},
            {"text": "بیشتر از ۱۰ سال", "score": 4},
        ],
    },
    {
        "id": 2,
        "text": "اگه ارزش پرتفویت تو یه ماه ۲۰ درصد افت کنه، چیکار می‌کنی؟",
        "options": [
            {"text": "همه رو می‌فروشم", "score": 1},
            {"text": "بخشیش رو می‌فروشم", "score": 2},
            {"text": "نگه می‌دارم و صبر می‌کنم", "score": 3},
            {"text": "بیشتر می‌خرم", "score": 4},
        ],
    },
    {
        "id": 3,
        "text": "درآمد فعلیت رو چطور توصیف می‌کنی؟",
        "options": [
            {"text": "نامنظم و نامطمئن", "score": 1},
            {"text": "نسبتاً پایدار", "score": 2},
            {"text": "پایدار", "score": 3},
            {"text": "خیلی پایدار، با پس‌انداز کافی", "score": 4},
        ],
    },
    {
        "id": 4,
        "text": "چقدر با نوسانات بازارهای مالی آشنایی داری؟",
        "options": [
            {"text": "هیچ تجربه‌ای ندارم", "score": 1},
            {"text": "کمی آشنایی دارم", "score": 2},
            {"text": "تجربه‌ی متوسط دارم", "score": 3},
            {"text": "تجربه‌ی زیاد و عمیق دارم", "score": 4},
        ],
    },
    {
        "id": 5,
        "text": "هدف اصلیت از این سرمایه‌گذاری چیه؟",
        "options": [
            {"text": "حفظ سرمایه", "score": 1},
            {"text": "درآمد ثابت و منظم", "score": 2},
            {"text": "رشد متعادل", "score": 3},
            {"text": "حداکثر رشد بلندمدت", "score": 4},
        ],
    },
]
